trade_exp/src/DataProcessors/КартографическийИнтерфейсДоставка/КартографическийИнтерфейсДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КартографическийИнтерфейсДоставка</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/СтоимостьРазгрузки/СтоимостьРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d54f98f9-51ce-4356-9b5a-3c7b8f62b529">
  <name>СтоимостьРазгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="9e2d4638-9560-4085-b799-fe012b588958">
    <name>ЦенаДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e6fc1242-c954-40f4-b5e8-a1ffd899e453">
    <name>ЦенаДляКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6b081896-1908-4005-8b4b-4c28e017e88c">
    <name>ВремяРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ea4e457c-a051-4001-816d-f9753d70775e">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="e82dfc88-2a4b-4972-9b11-c483a036475c">
    <name>Этаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c0cb660d-1ef2-4e88-8439-152ff3e32cd6">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f94ac501-14b4-4d3c-9caa-8516f2fe5421">
    <name>Негабарит</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СпособыРазгрузки/СпособыРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e7636d21-6d19-4d96-b19e-e94182f070d4">
  <name>СпособыРазгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8c0bf844-f44c-43d5-8097-51134c50d344">
    <name>Разгрузка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26ace864-d4a0-4907-a327-5e0cf303bd63">
    <name>Лестница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e772ea99-2dd1-4d35-a205-a67c818dbd45">
    <name>Лифт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/КартографическийИнтерфейсДоставка/Forms/НастройкаПараметровРазгрузки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрытоИзДокумента = Ложь;
		
	Если Параметры.Свойство("ПараметрыРазгрузкиАдресВХранилище") Тогда
		
		СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыРазгрузкиАдресВХранилище);
		
		Если Не СтруктураПараметров.ТЗТоварыКРазгрузке = Неопределено Тогда
			
			ОткрытоИзДокумента = Истина;
			
			ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураПараметров);
			
			Если ЧастныйДом Тогда
				Этаж = 1;
			Иначе
				Элементы.НомерКвартиры.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли;
			
			ТоварыКРазгрузке.Загрузить(СтруктураПараметров.ТЗТоварыКРазгрузке);			
			
			Если ТоварыКРазгрузке.Количество() = 0 Тогда
				Сообщить("Нет товаров к разгрузке, проверьте заполнено ли основание (документ продажи) и адрес!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			ТаблицаЗначений = Новый ТаблицаЗначений;
		    ТаблицаЗначений = ТоварыКРазгрузке;
			
			ТаблицаЗначений.Сортировать("Длина Возр");
		    МинимальнаяДлина = ТаблицаЗначений[0].Длина;
			
			ТаблицаЗначений.Сортировать("Площадь Возр");
		    МинимальнаяПлощадь = ТаблицаЗначений[0].Площадь; 
				
			ТаблицаЗначений.Сортировать("ВесЕдиницыДляРазгрузки Возр");
			МинимальныйВес = ТаблицаЗначений[0].ВесЕдиницыДляРазгрузки;
			
			ЗаполнитьМаксимальныйЭтажИВес();
			ЗаполнитьДоступныеВариантыРазгрузки(РучнаяКорректировкаВариантовРазгрузки);
			ЗаполнитьСтоимостьРазгрузки();
					
			НайденныеСтроки = ТоварыКРазгрузке.НайтиСтроки(Новый Структура("КрупногабаритныйМаловесныйТовар", Истина));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для Каждого НСтрока Из НайденныеСтроки Цикл 
					СтрокаТЗ = КрупногабаритныеМаловесныеТовары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, НСтрока);
				КонецЦикла;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормыПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоказатьСкрытьДопКолонкиПриИзменении(Элемент)
	
	Элементы.ТоварыКРазгрузкеЛифтГруппа.Видимость = ПоказатьСкрытьДопКолонки;
	Элементы.ТоварыКРазгрузкеЛестницаГруппа.Видимость = ПоказатьСкрытьДопКолонки;
	Элементы.ТоварыКРазгрузкеРазгрузкаГруппа.Видимость = ПоказатьСкрытьДопКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаВариантовРазгрузкиПриИзменении(Элемент)  
	
	Элементы.ТоварыКРазгрузке.Видимость = РучнаяКорректировкаВариантовРазгрузки; 
	
	Если НЕ РучнаяКорректировкаВариантовРазгрузки Тогда
		
		НайденныеСтроки = ТоварыКРазгрузке.НайтиСтроки(Новый Структура("ВариантыРазгрузкиВРучную", Истина));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл 
				СтрокаТЗ.Разгрузка = СтрокаТЗ.ИсходноеЗначениеРазгрузка;
				СтрокаТЗ.Лестница = СтрокаТЗ.ИсходноеЗначениеЛестница;
				СтрокаТЗ.Лифт = СтрокаТЗ.ИсходноеЗначениеЛифт;
				СтрокаТЗ.ЛифтГрузовой = СтрокаТЗ.ИсходноеЗначениеЛифтГрузовой;
				СтрокаТЗ.ВариантыРазгрузкиВРучную = Ложь;
			КонецЦикла;
		КонецЕсли;
		
		ЗаполнитьСтоимостьРазгрузки();
   		УстановитьВидимостьТаблицВидовРазгрузки(); 
	КонецЕсли;
	ЗаполнитьДоступныеВариантыРазгрузки(РучнаяКорректировкаВариантовРазгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодъемНаЭтажПриИзменении(Элемент)
	
	ЗаполнитьСтоимостьРазгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийВесПриИзменении(Элемент)
	
	ЗаполнитьСтоимостьРазгрузки(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФорм

&НаКлиенте
Процедура КРазгрузкеРазгрузкаПриИзменении(Элемент)
	
	ПриРучномИзмененииВариантовРазгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура КРазгрузкеЛестницаПриИзменении(Элемент)
	
	ПриРучномИзмененииВариантовРазгрузки();

КонецПроцедуры

&НаКлиенте
Процедура КРазгрузкеЛифтПриИзменении(Элемент)
	
	ПриРучномИзмененииВариантовРазгрузки();
	
КонецПроцедуры   

&НаКлиенте
Процедура КРазгрузкеЛифтГрузовойПриИзменении(Элемент)
	
	ПриРучномИзмененииВариантовРазгрузки(Истина);

КонецПроцедуры  

&НаКлиенте
Процедура ПриРучномИзмененииВариантовРазгрузки(ЛифтГрузовой = Ложь)
	
	ТекущиеДанные = Элементы.ТоварыКРазгрузке.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ВариантыРазгрузкиВРучную Тогда	
		ТекущиеДанные.ВариантыРазгрузкиВРучную = Истина;
	КонецЕсли; 

	Если ЛифтГрузовой И ТекущиеДанные.ЛифтГрузовой Тогда 
		ТекущиеДанные.Лифт = Истина;    
	КонецЕсли;
	
	ЗаполнитьСтоимостьРазгрузки();
	УстановитьВидимостьТаблицВидовРазгрузки();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодтвердитьИЗакрыть(Команда)
	
	Если Этаж = 0 ИЛИ (НомерКвартиры = 0 И Не ЧастныйДом) ИЛИ Не ЗначениеЗаполнено(ВариантРазгрузки) Тогда
		Сообщить("Не заполнены этаж, номер квартиры или вариант разгрузки!");
	ИначеЕсли НеУстановленыЦеныСтоимостиРазгрузки Тогда
		Сообщить("Разгрузка не осуществляется, не установлены цены!");
	Иначе 
		ДоставкаСРазгрузкой = Этаж > 0 И ЗначениеЗаполнено(ВариантРазгрузки);  	
		Результат = Новый Структура("Этаж, НомерКвартиры, ВариантРазгрузки, СтоимостьРазгрузкиДляКлиента, СтоимостьРазгрузкиДляВодителя, ДоставкаСРазгрузкой, НаличиеПандуса, РучнаяКорректировкаВариантовРазгрузки", Этаж, НомерКвартиры, ВариантРазгрузки, СтоимостьУслугиДляКлиента, СтоимостьУслугиДляВодителя, ДоставкаСРазгрузкой, НаличиеПандуса, РучнаяКорректировкаВариантовРазгрузки);
		
		Если РучнаяКорректировкаВариантовРазгрузки Тогда 
			ДополнитьРезультатТаблицейВариантовРазгрузки(Результат); 
		КонецЕсли;
		
		Закрыть(Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьРезультатТаблицейВариантовРазгрузки(Результат)
	
	ТаблицаВариантовРазгрузкиВРучную = ТоварыКРазгрузке.Выгрузить(Новый Структура("ВариантыРазгрузкиВРучную", Истина), "Номенклатура, Разгрузка, Лестница, Лифт, ЛифтГрузовой");
	Если ТаблицаВариантовРазгрузкиВРучную.Количество() > 0 Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаВариантовРазгрузкиВРучную, Новый УникальныйИдентификатор());
	КонецЕсли;
	Результат.Вставить("ВариантыРазгрузкиВРучнуюАдресВХранилище", АдресВХранилище);
	
КонецПроцедуры

Процедура ЗаполнитьМаксимальныйЭтажИВес()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(СтоимостьРазгрузкиСрезПоследних.Вес) КАК Вес,
	|	МАКСИМУМ(СтоимостьРазгрузкиСрезПоследних.Этаж) КАК Этаж
	|ИЗ
	|	РегистрСведений.СтоимостьРазгрузки.СрезПоследних КАК СтоимостьРазгрузкиСрезПоследних";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		МаксимальныйВесСтоимостьРазгрузки = Выборка.Вес;
		МаксимальныйЭтажСтоимостьРазгрузки = Выборка.Этаж;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗаполнитьСтоимостьРазгрузки()
		
	Если ОткрытоИзДокумента Тогда
		ОчиститьДанные();
		
		КоличествоСпособовРазгрузки = 0;
		
		//Распределение товаров по вариантам разгрузки
		Если ВариантРазгрузки.Способ = Перечисления.СпособыРазгрузки.Лифт Тогда	
			ЗаполнитьТоварыКРазгрузкеЛифт(ВариантРазгрузки.ЛифтГрузовой);					
			ЗаполнитьТоварыКРазгрузкеЛестница();			
		Иначе 
			Если ВариантРазгрузки.Способ = Перечисления.СпособыРазгрузки.Лестница Тогда	
				ЗаполнитьТоварыКРазгрузкеЛестница();					
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТоварыКРазгрузкеРазгрузка();
		
		ТекстПодсказки = "";
		
		ОбщийВес = ВесТовараРазгрузка + ВесТовараЛестница + ВесТовараЛифт;
		ОбщийВесНегабарит = ВесТовараРазгрузкаНегабарит + ВесТовараЛестницаНегабарит + ВесТовараЛифтНегабарит;
		ВремяВыгрузки = ВремяВыгрузкиРазгрузка + ВремяВыгрузкиЛифт + ВремяВыгрузкиЛестница;
				
		Если Этаж > МаксимальныйЭтажСтоимостьРазгрузки ИЛИ ОбщийВес > МаксимальныйВесСтоимостьРазгрузки Тогда  	
			СтоимостьУслугиДляКлиента = 0;
			СтоимостьУслугиДляВодителя = 0; 
			НеУстановленыЦеныСтоимостиРазгрузки = Истина;	
		Иначе
			//Расчет стоимости для клиента
			МинимальнаяСтоимостьДляКлиента = УправлениеЛогистикойСервер.МинимальнаяСтоимостьРазгрузкиДляКлиента();
			СтоимостьУслугиДляКлиента = СтоимостьДляКлиентаЛифт + СтоимостьДляКлиентаЛестница + СтоимостьДляКлиентаРазгрузка;

			Если КоличествоСпособовРазгрузки > 1 Тогда
				
				Если ВремяВыгрузки < 1 Тогда 
					СтоимостьУслугиДляКлиента = СтоимостьДляКлиентаЛифт + СтоимостьДляКлиентаЛестница + СтоимостьДляКлиентаРазгрузка - МинимальнаяСтоимостьДляКлиента;
					ТекстПодсказки = "Так как вариантов разгрузки больше одного и время разгрузки меньше одного часа, то от стоимости для клиента дополнительно вычитается минимальная стоимость разгрузки для клиента - " + Строка(МинимальнаяСтоимостьДляКлиента) +  "." + Символы.ПС;
				КонецЕсли;
				
			КонецЕсли;
			
			//Расчет стоимости для водителя
			МинимальнаяСтоимостьДляВодителя = УправлениеЛогистикойСервер.МинимальнаяСтоимостьРазгрузкиДляВодителя();
			СтоимостьУслугиДляВодителя = СтоимостьДляВодителяЛифт + СтоимостьДляВодителяЛестница + СтоимостьДляВодителяРазгрузка;
		
			Если КоличествоСпособовРазгрузки > 1 Тогда
				
				Если ВремяВыгрузки > 2 Тогда
					Если ОбщийВесНегабарит > 0 Тогда
						СтоимостьУслугиДляВодителя = ВремяВыгрузки * МинимальнаяСтоимостьДляВодителя * 2;
						ТекстПодсказки = ТекстПодсказки + "Так как вариантов разгрузки больше одного, время разгрузки больше двух часов и присутствует негабаритный товар, то стоимости для водителя рассчитывается, как 2 * Время разгрузки * Минимальную стоимость для водителя (" + Строка(МинимальнаяСтоимостьДляВодителя) + ").";
					Иначе
						СтоимостьУслугиДляВодителя = ВремяВыгрузки * МинимальнаяСтоимостьДляВодителя;
						ТекстПодсказки = ТекстПодсказки + "Так как вариантов разгрузки больше одного и время разгрузки больше двух часов, то стоимости для водителя рассчитывается, как Время разгрузки * Минимальную стоимость для водителя (" + Строка(МинимальнаяСтоимостьДляВодителя) + ").";
					КонецЕсли;
				Иначе
					СтоимостьУслугиДляВодителя = ?(СтоимостьДляВодителяЛифт > СтоимостьДляВодителяЛестница,?(СтоимостьДляВодителяЛифт > СтоимостьДляВодителяРазгрузка, СтоимостьДляВодителяЛифт, СтоимостьДляВодителяРазгрузка),?(СтоимостьДляВодителяЛестница > СтоимостьДляВодителяРазгрузка,СтоимостьДляВодителяЛестница, СтоимостьДляВодителяРазгрузка));
					ТекстПодсказки = ТекстПодсказки + "Так как вариантов разгрузки больше одного и время разгрузки меньше двух часов, то стоимость для водителя рассчитывается, как максимальная среди полученных значений по вариантам разгрузки.";
				КонецЕсли;	
				
				СтоимостьУслугиДляВодителя = ОКР(СтоимостьУслугиДляВодителя, -1); 
				
			КонецЕсли; 
			
			Элементы.ГруппаОбщийИтог.Подсказка = ТекстПодсказки; 
			НеУстановленыЦеныСтоимостиРазгрузки = Ложь;
		КонецЕсли; 
		Элементы.ДекорацияНеУстановленыЦены.Видимость = НеУстановленыЦеныСтоимостиРазгрузки; 
	Иначе
		СтруктураСтоимости = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(ОбщийВес, Этаж, Дата, Зона, Ложь, ВариантРазгрузки.Способ);
		СтоимостьУслугиДляКлиента = СтруктураСтоимости.ЦенаДляКлиента;
		СтоимостьУслугиДляВодителя = СтруктураСтоимости.ЦенаДляВодителя;
	КонецЕсли; 
	
	СтавкаНДСЧислом = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(УчетНДСУП.СтавкаНДСПоУмолчанию(Неопределено,Дата)) / 100 + 1;
	СтоимостьУслугиДляКлиентаСНдс = СтоимостьУслугиДляКлиента * СтавкаНДСЧислом;
	СтоимостьУслугиДляВодителяСНдс = СтоимостьУслугиДляВодителя * СтавкаНДСЧислом;
	
КонецПроцедуры

Процедура ЗаполнитьДоступныеВариантыРазгрузки(РучнаяКорректировкаВариантов)
	
	Если РучнаяКорректировкаВариантов Тогда
		ВариантыРазгрузки.Загрузить(УправлениеЛогистикойСервер.ПолучитьДоступныеВариантыРазгрузки(0, 0, 0));	
	Иначе
		ВариантыРазгрузки.Загрузить(УправлениеЛогистикойСервер.ПолучитьДоступныеВариантыРазгрузки(МинимальнаяДлина, МинимальнаяПлощадь, МинимальныйВес));
	КонецЕсли;  
	
КонецПроцедуры

Процедура ЗаполнитьТоварыКРазгрузкеЛифт(Грузовой=Ложь)
	
	ТоварыКразгрузкеЛифт.Очистить();
	
	СтрокаКолонки = "Лифт" + ?(Грузовой,"Грузовой","");
	МассивСтрок = ТоварыКРазгрузкеНеВыгружается.НайтиСтроки(Новый Структура(СтрокаКолонки,Истина));
	
	Для каждого СтрокаТовара из МассивСтрок Цикл
		
		НоваяСтрока = ТоварыКРазгрузкеЛифт.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовара);
		ТоварыКРазгрузкеНеВыгружается.Удалить(СтрокаТовара);
		
	КонецЦикла;
	
	ВесТовараЛифт = ТоварыКРазгрузкеЛифт.Итог("Вес");
	ОбщийОбъем = ОбщийОбъем + ТоварыКРазгрузкеЛифт.Итог("Объем");

	ВесТовараЛифтНегабарит = 0;
	ВремяРазгрузкиНегабарит = 0;
	СтоимостьДляКлиентаЛифтНегабарит = 0;
	СтоимостьДляВодителяЛифтНегабарит = 0;
	
	МассивСтрокЛифтНегабарит = ТоварыКРазгрузкеЛифт.НайтиСтроки(Новый Структура("Негабарит",Истина));
	
	Для каждого Строка из МассивСтрокЛифтНегабарит Цикл  
		
		ВесТовараЛифтНегабарит = ВесТовараЛифтНегабарит + Строка.Вес;
		
	КонецЦикла;
	
	Если ВесТовараЛифт > 0 Тогда
		СтруктураСтоимостиЛифт = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(ВесТовараЛифт,Этаж,Дата,Зона,ВесТовараЛифтНегабарит > 0,Перечисления.СпособыРазгрузки.Лифт);
		СтоимостьДляКлиентаЛифт = СтруктураСтоимостиЛифт.ЦенаДляКлиента;
		СтоимостьДляВодителяЛифт = СтруктураСтоимостиЛифт.ЦенаДляВодителя;
		ВремяВыгрузкиЛифт = СтруктураСтоимостиЛифт.ВремяРазгрузки;
		КоличествоСпособовРазгрузки = КоличествоСпособовРазгрузки + 1;	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТоварыКРазгрузкеЛестница()
	
	ТоварыКразгрузкеЛестница.Очистить();
	МассивСтрок = ТоварыКРазгрузкеНеВыгружается.НайтиСтроки(Новый Структура("Лестница",Истина));
	
	Для каждого СтрокаТовара из МассивСтрок Цикл
		
		НоваяСтрока = ТоварыКРазгрузкеЛестница.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовара);
		ТоварыКРазгрузкеНеВыгружается.Удалить(СтрокаТовара);
		
	КонецЦикла;	
	
	ВесТовараЛестница = ТоварыКРазгрузкеЛестница.Итог("Вес");
	ОбщийОбъем = ОбщийОбъем + ТоварыКРазгрузкеЛестница.Итог("Объем");

	ВесТовараЛестницаНегабарит = 0;
	ВремяРазгрузкиНегабарит = 0;
	СтоимостьДляКлиентаЛестницаНегабарит = 0;
	СтоимостьДляВодителяЛестницаНегабарит = 0;
	
	МассивСтрокЛестницаНегабарит = ТоварыКРазгрузкеЛестница.НайтиСтроки(Новый Структура("Негабарит",Истина));
	
	Для каждого Строка из МассивСтрокЛестницаНегабарит Цикл  
		
		ВесТовараЛестницаНегабарит = ВесТовараЛестницаНегабарит + Строка.Вес;
		
	КонецЦикла;
	
	Если ВесТовараЛестница > 0 Тогда
		СтруктураСтоимостиЛестница = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(ВесТовараЛестница,Этаж,Дата,Зона,ВесТовараЛестницаНегабарит > 0,Перечисления.СпособыРазгрузки.Лестница);
		СтоимостьДляКлиентаЛестница = СтруктураСтоимостиЛестница.ЦенаДляКлиента;
		СтоимостьДляВодителяЛестница = СтруктураСтоимостиЛестница.ЦенаДляВодителя;
		ВремяВыгрузкиЛестница = СтруктураСтоимостиЛестница.ВремяРазгрузки;
		КоличествоСпособовРазгрузки = КоличествоСпособовРазгрузки + 1;	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТоварыКРазгрузкеРазгрузка()
	
	ТоварыКразгрузкеРазгрузка.Очистить();
	МассивСтрок = ТоварыКРазгрузкеНеВыгружается.НайтиСтроки(Новый Структура("Разгрузка",Истина));
	
	Для каждого СтрокаТовара из МассивСтрок Цикл
		
		НоваяСтрока = ТоварыКРазгрузкеРазгрузка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовара);
		ТоварыКРазгрузкеНеВыгружается.Удалить(СтрокаТовара);
		
	КонецЦикла;	
	
	ВесТовараРазгрузка = ТоварыКРазгрузкеРазгрузка.Итог("Вес");
	ОбщийОбъем = ОбщийОбъем + ТоварыКРазгрузкеРазгрузка.Итог("Объем");
	
	ВесТовараРазгрузкаНегабарит = 0;
	ВремяРазгрузкиНегабарит = 0;
	СтоимостьДляКлиентаРазгрузкаНегабарит = 0;
	СтоимостьДляВодителяРазгрузкаНегабарит = 0;
	
	МассивСтрокРазгрузкаНегабарит = ТоварыКРазгрузкеРазгрузка.НайтиСтроки(Новый Структура("Негабарит",Истина));
	
	Для каждого Строка из МассивСтрокРазгрузкаНегабарит Цикл  
		
		ВесТовараРазгрузкаНегабарит = ВесТовараРазгрузкаНегабарит + Строка.Вес;
		
	КонецЦикла;
	
	Если ВесТовараРазгрузка > 0 Тогда
		СтруктураСтоимости = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(ВесТовараРазгрузка,Этаж,Дата,Зона,ВесТовараРазгрузкаНегабарит > 0,Перечисления.СпособыРазгрузки.Разгрузка);
		СтоимостьДляКлиентаРазгрузка = СтруктураСтоимости.ЦенаДляКлиента;
		СтоимостьДляВодителяРазгрузка = СтруктураСтоимости.ЦенаДляВодителя;
		ВремяВыгрузкиРазгрузка = СтруктураСтоимости.ВремяРазгрузки;
		КоличествоСпособовРазгрузки = КоличествоСпособовРазгрузки + 1;	
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВидимостьЭлементовФормыПоУмолчанию()
	
	Если ОткрытоИзДокумента Тогда
		Элементы.ОбщийВес.ТолькоПросмотр = Истина;
		Элементы.Декорация1.Видимость = ВариантыРазгрузки.Количество()=0;
		УстановитьВидимостьТаблицВидовРазгрузки();	
	Иначе	
		Элементы.СтраницаПоясненияРасчета.Видимость = Ложь;
		Элементы.НомерКвартиры.Видимость = Ложь;
		Элементы.НаличиеПандуса.Видимость = Ложь;	
	КонецЕсли;  
	
	Элементы.ТоварыКРазгрузке.Видимость = РучнаяКорректировкаВариантовРазгрузки;
	
	Элементы.Декорация3.Видимость = Зона.Пустая();
	
	ВидимостьСтоимостиДляВодителя = УправлениеЛогистикойСервер.ВидимостьСтоимостиДляВодителя();	
	Элементы.СтоимостьДляВодителяЛестница.Видимость = ВидимостьСтоимостиДляВодителя;
	Элементы.СтоимостьДляВодителяЛифт.Видимость = ВидимостьСтоимостиДляВодителя;
	Элементы.СтоимостьДляВодителяРазгрузка.Видимость = ВидимостьСтоимостиДляВодителя;
	Элементы.СтоимостьУслугиДляВодителя.Видимость = ВидимостьСтоимостиДляВодителя;
	Элементы.СтоимостьУслугиДляВодителя1.Видимость = ВидимостьСтоимостиДляВодителя;
	Элементы.СтоимостьУслугиДляВодителяСНДС.Видимость = ВидимостьСтоимостиДляВодителя; 
	
	Элементы.ГруппаБезДНС.Видимость = Не СНДС;
	Элементы.ГруппаСНДС.Видимость = СНДС; 	
	//Элементы.СтраницаПоясненияРасчета.Скрыть();
	
	Если КрупногабаритныеМаловесныеТовары.Количество() > 0 Тогда 
		Элементы.ГруппаКМТоваров.Видимость = Истина;
		Элементы.КМТовар.Заголовок = "Отношение Веса(тонн) к Объему(м3) менее 0,1
									|Условный вес* = " + ОбщийВес + "
									|
									|*Для расчета стоимости разгрузки крупногабаритного маловесного товара используется условная единица веса.";
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьТаблицВидовРазгрузки()  
	
	ВидимостьСпособаЛифт = ТоварыКРазгрузкеЛифт.Количество()>0;
	ВидимостьСпособаЛестница = ТоварыКРазгрузкеЛестница.Количество()>0;
	ВидимостьСпособаРазгрузка = ТоварыКРазгрузкеРазгрузка.Количество()>0;
	ВидимостьСпособаНеВыгружается = ТоварыКРазгрузкеНеВыгружается.Количество()>0;
	
	Элементы.ТоварыКРазгрузкеЛифт.Заголовок = "Подъем на лифте на " + Строка(Этаж) + " этаж";
	Элементы.ТоварыКРазгрузкеЛифт.Видимость = ВидимостьСпособаЛифт;
	Элементы.ГруппаИтогиПоЛифту.Видимость = ВидимостьСпособаЛифт;
	Элементы.ТоварыКРазгрузкеЛестница.Заголовок = "Подъем по лестнице на " + Строка(Этаж) + " этаж";
	Элементы.ТоварыКРазгрузкеЛестница.Видимость = ВидимостьСпособаЛестница;
	Элементы.ГруппаИтогиПоЛестнице.Видимость = ВидимостьСпособаЛестница;
	Элементы.ТоварыКРазгрузкеРазгрузка.Видимость = ВидимостьСпособаРазгрузка;
	Элементы.ГруппаИтогиПоРазгрузке.Видимость = ВидимостьСпособаРазгрузка;
	Элементы.ТоварыКРазгрузкеНеВыгружается.Видимость = ВидимостьСпособаНеВыгружается;
	Элементы.Декорация2.Видимость = ВидимостьСпособаНеВыгружается;
		
КонецПроцедуры

Функция ТолькоРазгрузка(ВариантРазгрузки)
	
	Возврат ВариантРазгрузки.Способ = Перечисления.СпособыРазгрузки.Разгрузка;
	
КонецФункции

Процедура ОчиститьДанные()
	ВесТовараЛифт = 0;
	ВесТовараЛестница = 0;
	ВесТовараРазгрузка = 0;
	СтоимостьДляКлиентаРазгрузка =0;
	СтоимостьДляВодителяРазгрузка =0;
	СтоимостьДляКлиентаЛестница =0;
	СтоимостьДляВодителяЛестница =0;
	СтоимостьДляКлиентаЛифт =0;
	СтоимостьДляВодителяЛифт =0;
	СтоимостьУслугиДляКлиента = 0;
	СтоимостьУслугиДляВодителя=0;
	ОбщийВес = 0;
	ОбщийОбъем = 0;
	
	ТоварыКРазгрузкеНеВыгружается.Очистить();
	ТоварыКРазгрузкеНеВыгружается.Загрузить(ТоварыКРазгрузке.Выгрузить());
Конецпроцедуры

&НаКлиенте
Процедура ВариантРазгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ВариантыРазгрузки.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыРазгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.ВариантыРазгрузки.Видимость = Ложь;

	ВариантРазгрузки = Элементы.ВариантыРазгрузки.ТекущиеДанные.ВариантРазгрузки;
	
	Если ТолькоРазгрузка(ВариантРазгрузки) Тогда
		Элементы.ПодъемНаЭтаж.ТолькоПросмотр = Истина;
		Этаж = 1;
	Иначе
		Элементы.ПодъемНаЭтаж.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	ЗаполнитьСтоимостьРазгрузки();
	УстановитьВидимостьТаблицВидовРазгрузки();

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Элементы.ВариантыРазгрузки.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КМТоварОзнакомлениеСРасчетомНажатие(Элемент)
	
	АдресТоваровВХранилище = ПоместитьТоварыВХранилище(); 
	ПараметрыФормы = Новый Структура("АдресТоваровВХранилище", АдресТоваровВХранилище);
	ОткрытьФорму("Обработка.КартографическийИнтерфейсДоставка.Форма.ОсобенностиРасчетаВеса", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры   

&НаСервере
Функция ПоместитьТоварыВХранилище()

	Возврат ПоместитьВоВременноеХранилище(КрупногабаритныеМаловесныеТовары.Выгрузить(), УникальныйИдентификатор);
		
КонецФункции

#КонецОбласти
